SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM24/Include/mgm24_protimer.h
/* Bit fields for PROTIMER CMD */
#define _PROTIMER_CMD_RESETVALUE                         0x00000000UL                              /**< Default value for PROTIMER_CMD              */
#define _PROTIMER_CMD_MASK                               0x000707F7UL                              /**< Mask for PROTIMER_CMD                       */
#define PROTIMER_CMD_START                               (0x1UL << 0)                              /**< Start PROTIMER                              */
#define _PROTIMER_CMD_START_SHIFT                        0                                         /**< Shift value for PROTIMER_START              */
#define _PROTIMER_CMD_START_MASK                         0x1UL                                     /**< Bit mask for PROTIMER_START                 */
#define _PROTIMER_CMD_START_DEFAULT                      0x00000000UL                              /**< Mode DEFAULT for PROTIMER_CMD               */
#define PROTIMER_CMD_START_DEFAULT                       (_PROTIMER_CMD_START_DEFAULT << 0)        /**< Shifted mode DEFAULT for PROTIMER_CMD       */
#define PROTIMER_CMD_RTCSYNCSTART                        (0x1UL << 1)                              /**< Start PROTIMER Synchronized with RTCC       */
#define _PROTIMER_CMD_RTCSYNCSTART_SHIFT                 1                                         /**< Shift value for PROTIMER_RTCSYNCSTART       */
#define _PROTIMER_CMD_RTCSYNCSTART_MASK                  0x2UL                                     /**< Bit mask for PROTIMER_RTCSYNCSTART          */
#define _PROTIMER_CMD_RTCSYNCSTART_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for PROTIMER_CMD               */
#define PROTIMER_CMD_RTCSYNCSTART_DEFAULT                (_PROTIMER_CMD_RTCSYNCSTART_DEFAULT << 1) /**< Shifted mode DEFAULT for PROTIMER_CMD       */
#define PROTIMER_CMD_STOP                                (0x1UL << 2)                              /**< Stop PROTIMER                               */
#define _PROTIMER_CMD_STOP_SHIFT                         2                                         /**< Shift value for PROTIMER_STOP               */
#define _PROTIMER_CMD_STOP_MASK                          0x4UL                                     /**< Bit mask for PROTIMER_STOP                  */
#define _PROTIMER_CMD_STOP_DEFAULT                       0x00000000UL                              /**< Mode DEFAULT for PROTIMER_CMD               */
#define PROTIMER_CMD_STOP_DEFAULT                        (_PROTIMER_CMD_STOP_DEFAULT << 2)         /**< Shifted mode DEFAULT for PROTIMER_CMD       */
#define PROTIMER_CMD_TOUT0START                          (0x1UL << 4)                              /**< Start Timeout counter 0                     */
#define _PROTIMER_CMD_TOUT0START_SHIFT                   4                                         /**< Shift value for PROTIMER_TOUT0START         */
#define _PROTIMER_CMD_TOUT0START_MASK                    0x10UL                                    /**< Bit mask for PROTIMER_TOUT0START            */
#define _PROTIMER_CMD_TOUT0START_DEFAULT                 0x00000000UL                              /**< Mode DEFAULT for PROTIMER_CMD               */
#define PROTIMER_CMD_TOUT0START_DEFAULT                  (_PROTIMER_CMD_TOUT0START_DEFAULT << 4)   /**< Shifted mode DEFAULT for PROTIMER_CMD       */
#define PROTIMER_CMD_TOUT0STOP                           (0x1UL << 5)                              /**< Stop Timeout counter 0                      */
#define _PROTIMER_CMD_TOUT0STOP_SHIFT                    5                                         /**< Shift value for PROTIMER_TOUT0STOP          */
#define _PROTIMER_CMD_TOUT0STOP_MASK                     0x20UL                                    /**< Bit mask for PROTIMER_TOUT0STOP             */
#define _PROTIMER_CMD_TOUT0STOP_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for PROTIMER_CMD               */
#define PROTIMER_CMD_TOUT0STOP_DEFAULT                   (_PROTIMER_CMD_TOUT0STOP_DEFAULT << 5)    /**< Shifted mode DEFAULT for PROTIMER_CMD       */
#define PROTIMER_CMD_TOUT1START                          (0x1UL << 6)                              /**< Start Timeout counter 1                     */
#define _PROTIMER_CMD_TOUT1START_SHIFT                   6                                         /**< Shift value for PROTIMER_TOUT1START         */
#define _PROTIMER_CMD_TOUT1START_MASK                    0x40UL                                    /**< Bit mask for PROTIMER_TOUT1START            */
#define _PROTIMER_CMD_TOUT1START_DEFAULT                 0x00000000UL                              /**< Mode DEFAULT for PROTIMER_CMD               */
#define PROTIMER_CMD_TOUT1START_DEFAULT                  (_PROTIMER_CMD_TOUT1START_DEFAULT << 6)   /**< Shifted mode DEFAULT for PROTIMER_CMD       */
#define PROTIMER_CMD_TOUT1STOP                           (0x1UL << 7)                              /**< Stop Timeout counter 0                      */
#define _PROTIMER_CMD_TOUT1STOP_SHIFT                    7                                         /**< Shift value for PROTIMER_TOUT1STOP          */
#define _PROTIMER_CMD_TOUT1STOP_MASK                     0x80UL                                    /**< Bit mask for PROTIMER_TOUT1STOP             */
#define _PROTIMER_CMD_TOUT1STOP_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for PROTIMER_CMD               */
#define PROTIMER_CMD_TOUT1STOP_DEFAULT                   (_PROTIMER_CMD_TOUT1STOP_DEFAULT << 7)    /**< Shifted mode DEFAULT for PROTIMER_CMD       */
#define PROTIMER_CMD_FORCETXIDLE                         (0x1UL << 8)                              /**< Force to Idle state of tx_state             */
#define _PROTIMER_CMD_FORCETXIDLE_SHIFT                  8                                         /**< Shift value for PROTIMER_FORCETXIDLE        */
#define _PROTIMER_CMD_FORCETXIDLE_MASK                   0x100UL                                   /**< Bit mask for PROTIMER_FORCETXIDLE           */
#define _PROTIMER_CMD_FORCETXIDLE_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for PROTIMER_CMD               */
#define PROTIMER_CMD_FORCETXIDLE_DEFAULT                 (_PROTIMER_CMD_FORCETXIDLE_DEFAULT << 8)  /**< Shifted mode DEFAULT for PROTIMER_CMD       */
#define PROTIMER_CMD_FORCERXIDLE                         (0x1UL << 9)                              /**< Force to Idle state of rx_state             */
#define _PROTIMER_CMD_FORCERXIDLE_SHIFT                  9                                         /**< Shift value for PROTIMER_FORCERXIDLE        */
#define _PROTIMER_CMD_FORCERXIDLE_MASK                   0x200UL                                   /**< Bit mask for PROTIMER_FORCERXIDLE           */
#define _PROTIMER_CMD_FORCERXIDLE_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for PROTIMER_CMD               */
#define PROTIMER_CMD_FORCERXIDLE_DEFAULT                 (_PROTIMER_CMD_FORCERXIDLE_DEFAULT << 9)  /**< Shifted mode DEFAULT for PROTIMER_CMD       */
#define PROTIMER_CMD_FORCERXRX                           (0x1UL << 10)                             /**< Force to Rx state of rx_state               */
#define _PROTIMER_CMD_FORCERXRX_SHIFT                    10                                        /**< Shift value for PROTIMER_FORCERXRX          */
#define _PROTIMER_CMD_FORCERXRX_MASK                     0x400UL                                   /**< Bit mask for PROTIMER_FORCERXRX             */
#define _PROTIMER_CMD_FORCERXRX_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for PROTIMER_CMD               */
#define PROTIMER_CMD_FORCERXRX_DEFAULT                   (_PROTIMER_CMD_FORCERXRX_DEFAULT << 10)   /**< Shifted mode DEFAULT for PROTIMER_CMD       */
#define PROTIMER_CMD_LBTSTART                            (0x1UL << 16)                             /**< LBT sequence start                          */
#define _PROTIMER_CMD_LBTSTART_SHIFT                     16                                        /**< Shift value for PROTIMER_LBTSTART           */
#define _PROTIMER_CMD_LBTSTART_MASK                      0x10000UL                                 /**< Bit mask for PROTIMER_LBTSTART              */
#define _PROTIMER_CMD_LBTSTART_DEFAULT                   0x00000000UL                              /**< Mode DEFAULT for PROTIMER_CMD               */
#define PROTIMER_CMD_LBTSTART_DEFAULT                    (_PROTIMER_CMD_LBTSTART_DEFAULT << 16)    /**< Shifted mode DEFAULT for PROTIMER_CMD       */
#define PROTIMER_CMD_LBTPAUSE                            (0x1UL << 17)                             /**< Pause LBT sequence                          */
#define _PROTIMER_CMD_LBTPAUSE_SHIFT                     17                                        /**< Shift value for PROTIMER_LBTPAUSE           */
#define _PROTIMER_CMD_LBTPAUSE_MASK                      0x20000UL                                 /**< Bit mask for PROTIMER_LBTPAUSE              */
#define _PROTIMER_CMD_LBTPAUSE_DEFAULT                   0x00000000UL                              /**< Mode DEFAULT for PROTIMER_CMD               */
#define PROTIMER_CMD_LBTPAUSE_DEFAULT                    (_PROTIMER_CMD_LBTPAUSE_DEFAULT << 17)    /**< Shifted mode DEFAULT for PROTIMER_CMD       */
#define PROTIMER_CMD_LBTSTOP                             (0x1UL << 18)                             /**< LBT sequence stop                           */
#define _PROTIMER_CMD_LBTSTOP_SHIFT                      18                                        /**< Shift value for PROTIMER_LBTSTOP            */
#define _PROTIMER_CMD_LBTSTOP_MASK                       0x40000UL                                 /**< Bit mask for PROTIMER_LBTSTOP               */
#define _PROTIMER_CMD_LBTSTOP_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for PROTIMER_CMD               */
#define PROTIMER_CMD_LBTSTOP_DEFAULT                     (_PROTIMER_CMD_LBTSTOP_DEFAULT << 18)     /**< Shifted mode DEFAULT for PROTIMER_CMD       */

/* Bit fields for PROTIMER PRSCTRL */
#define _PROTIMER_PRSCTRL_RESETVALUE                     0x00000000UL                                       /**< Default value for PROTIMER_PRSCTRL          */
#define _PROTIMER_PRSCTRL_MASK                           0x000E0E0EUL                                       /**< Mask for PROTIMER_PRSCTRL                   */
#define PROTIMER_PRSCTRL_STARTPRSEN                      (0x1UL << 1)                                       /**< Enable Protimer start commands from PRS.    */
#define _PROTIMER_PRSCTRL_STARTPRSEN_SHIFT               1                                                  /**< Shift value for PROTIMER_STARTPRSEN         */
#define _PROTIMER_PRSCTRL_STARTPRSEN_MASK                0x2UL                                              /**< Bit mask for PROTIMER_STARTPRSEN            */
#define _PROTIMER_PRSCTRL_STARTPRSEN_DEFAULT             0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_PRSCTRL           */
#define PROTIMER_PRSCTRL_STARTPRSEN_DEFAULT              (_PROTIMER_PRSCTRL_STARTPRSEN_DEFAULT << 1)        /**< Shifted mode DEFAULT for PROTIMER_PRSCTRL   */
#define _PROTIMER_PRSCTRL_STARTEDGE_SHIFT                2                                                  /**< Shift value for PROTIMER_STARTEDGE          */
#define _PROTIMER_PRSCTRL_STARTEDGE_MASK                 0xCUL                                              /**< Bit mask for PROTIMER_STARTEDGE             */
#define _PROTIMER_PRSCTRL_STARTEDGE_DEFAULT              0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_PRSCTRL           */
#define _PROTIMER_PRSCTRL_STARTEDGE_RISING               0x00000000UL                                       /**< Mode RISING for PROTIMER_PRSCTRL            */
#define _PROTIMER_PRSCTRL_STARTEDGE_FALLING              0x00000001UL                                       /**< Mode FALLING for PROTIMER_PRSCTRL           */
#define _PROTIMER_PRSCTRL_STARTEDGE_BOTH                 0x00000002UL                                       /**< Mode BOTH for PROTIMER_PRSCTRL              */
#define _PROTIMER_PRSCTRL_STARTEDGE_DISABLED             0x00000003UL                                       /**< Mode DISABLED for PROTIMER_PRSCTRL          */
#define PROTIMER_PRSCTRL_STARTEDGE_DEFAULT               (_PROTIMER_PRSCTRL_STARTEDGE_DEFAULT << 2)         /**< Shifted mode DEFAULT for PROTIMER_PRSCTRL   */
#define PROTIMER_PRSCTRL_STARTEDGE_RISING                (_PROTIMER_PRSCTRL_STARTEDGE_RISING << 2)          /**< Shifted mode RISING for PROTIMER_PRSCTRL    */
#define PROTIMER_PRSCTRL_STARTEDGE_FALLING               (_PROTIMER_PRSCTRL_STARTEDGE_FALLING << 2)         /**< Shifted mode FALLING for PROTIMER_PRSCTRL   */
#define PROTIMER_PRSCTRL_STARTEDGE_BOTH                  (_PROTIMER_PRSCTRL_STARTEDGE_BOTH << 2)            /**< Shifted mode BOTH for PROTIMER_PRSCTRL      */
#define PROTIMER_PRSCTRL_STARTEDGE_DISABLED              (_PROTIMER_PRSCTRL_STARTEDGE_DISABLED << 2)        /**< Shifted mode DISABLED for PROTIMER_PRSCTRL  */
#define PROTIMER_PRSCTRL_STOPPRSEN                       (0x1UL << 9)                                       /**< Enable Protimer stop commands from PRS.     */
#define _PROTIMER_PRSCTRL_STOPPRSEN_SHIFT                9                                                  /**< Shift value for PROTIMER_STOPPRSEN          */
#define _PROTIMER_PRSCTRL_STOPPRSEN_MASK                 0x200UL                                            /**< Bit mask for PROTIMER_STOPPRSEN             */
#define _PROTIMER_PRSCTRL_STOPPRSEN_DEFAULT              0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_PRSCTRL           */
#define PROTIMER_PRSCTRL_STOPPRSEN_DEFAULT               (_PROTIMER_PRSCTRL_STOPPRSEN_DEFAULT << 9)         /**< Shifted mode DEFAULT for PROTIMER_PRSCTRL   */
#define _PROTIMER_PRSCTRL_STOPEDGE_SHIFT                 10                                                 /**< Shift value for PROTIMER_STOPEDGE           */
#define _PROTIMER_PRSCTRL_STOPEDGE_MASK                  0xC00UL                                            /**< Bit mask for PROTIMER_STOPEDGE              */
#define _PROTIMER_PRSCTRL_STOPEDGE_DEFAULT               0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_PRSCTRL           */
#define _PROTIMER_PRSCTRL_STOPEDGE_RISING                0x00000000UL                                       /**< Mode RISING for PROTIMER_PRSCTRL            */
#define _PROTIMER_PRSCTRL_STOPEDGE_FALLING               0x00000001UL                                       /**< Mode FALLING for PROTIMER_PRSCTRL           */
#define _PROTIMER_PRSCTRL_STOPEDGE_BOTH                  0x00000002UL                                       /**< Mode BOTH for PROTIMER_PRSCTRL              */
#define _PROTIMER_PRSCTRL_STOPEDGE_DISABLED              0x00000003UL                                       /**< Mode DISABLED for PROTIMER_PRSCTRL          */
#define PROTIMER_PRSCTRL_STOPEDGE_DEFAULT                (_PROTIMER_PRSCTRL_STOPEDGE_DEFAULT << 10)         /**< Shifted mode DEFAULT for PROTIMER_PRSCTRL   */
#define PROTIMER_PRSCTRL_STOPEDGE_RISING                 (_PROTIMER_PRSCTRL_STOPEDGE_RISING << 10)          /**< Shifted mode RISING for PROTIMER_PRSCTRL    */
#define PROTIMER_PRSCTRL_STOPEDGE_FALLING                (_PROTIMER_PRSCTRL_STOPEDGE_FALLING << 10)         /**< Shifted mode FALLING for PROTIMER_PRSCTRL   */
#define PROTIMER_PRSCTRL_STOPEDGE_BOTH                   (_PROTIMER_PRSCTRL_STOPEDGE_BOTH << 10)            /**< Shifted mode BOTH for PROTIMER_PRSCTRL      */
#define PROTIMER_PRSCTRL_STOPEDGE_DISABLED               (_PROTIMER_PRSCTRL_STOPEDGE_DISABLED << 10)        /**< Shifted mode DISABLED for PROTIMER_PRSCTRL  */
#define PROTIMER_PRSCTRL_RTCCTRIGGERPRSEN                (0x1UL << 17)                                      /**< Enable RTCC Trigger from PRS.               */
#define _PROTIMER_PRSCTRL_RTCCTRIGGERPRSEN_SHIFT         17                                                 /**< Shift value for PROTIMER_RTCCTRIGGERPRSEN   */
#define _PROTIMER_PRSCTRL_RTCCTRIGGERPRSEN_MASK          0x20000UL                                          /**< Bit mask for PROTIMER_RTCCTRIGGERPRSEN      */
#define _PROTIMER_PRSCTRL_RTCCTRIGGERPRSEN_DEFAULT       0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_PRSCTRL           */
#define PROTIMER_PRSCTRL_RTCCTRIGGERPRSEN_DEFAULT        (_PROTIMER_PRSCTRL_RTCCTRIGGERPRSEN_DEFAULT << 17) /**< Shifted mode DEFAULT for PROTIMER_PRSCTRL   */
#define _PROTIMER_PRSCTRL_RTCCTRIGGEREDGE_SHIFT          18                                                 /**< Shift value for PROTIMER_RTCCTRIGGEREDGE    */
#define _PROTIMER_PRSCTRL_RTCCTRIGGEREDGE_MASK           0xC0000UL                                          /**< Bit mask for PROTIMER_RTCCTRIGGEREDGE       */
#define _PROTIMER_PRSCTRL_RTCCTRIGGEREDGE_DEFAULT        0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_PRSCTRL           */
#define _PROTIMER_PRSCTRL_RTCCTRIGGEREDGE_RISING         0x00000000UL                                       /**< Mode RISING for PROTIMER_PRSCTRL            */
#define _PROTIMER_PRSCTRL_RTCCTRIGGEREDGE_FALLING        0x00000001UL                                       /**< Mode FALLING for PROTIMER_PRSCTRL           */
#define _PROTIMER_PRSCTRL_RTCCTRIGGEREDGE_BOTH           0x00000002UL                                       /**< Mode BOTH for PROTIMER_PRSCTRL              */
#define _PROTIMER_PRSCTRL_RTCCTRIGGEREDGE_DISABLED       0x00000003UL                                       /**< Mode DISABLED for PROTIMER_PRSCTRL          */
#define PROTIMER_PRSCTRL_RTCCTRIGGEREDGE_DEFAULT         (_PROTIMER_PRSCTRL_RTCCTRIGGEREDGE_DEFAULT << 18)  /**< Shifted mode DEFAULT for PROTIMER_PRSCTRL   */
#define PROTIMER_PRSCTRL_RTCCTRIGGEREDGE_RISING          (_PROTIMER_PRSCTRL_RTCCTRIGGEREDGE_RISING << 18)   /**< Shifted mode RISING for PROTIMER_PRSCTRL    */
#define PROTIMER_PRSCTRL_RTCCTRIGGEREDGE_FALLING         (_PROTIMER_PRSCTRL_RTCCTRIGGEREDGE_FALLING << 18)  /**< Shifted mode FALLING for PROTIMER_PRSCTRL   */
#define PROTIMER_PRSCTRL_RTCCTRIGGEREDGE_BOTH            (_PROTIMER_PRSCTRL_RTCCTRIGGEREDGE_BOTH << 18)     /**< Shifted mode BOTH for PROTIMER_PRSCTRL      */
#define PROTIMER_PRSCTRL_RTCCTRIGGEREDGE_DISABLED        (_PROTIMER_PRSCTRL_RTCCTRIGGEREDGE_DISABLED << 18) /**< Shifted mode DISABLED for PROTIMER_PRSCTRL  */

